# StairSetNumRisers

## Description
Sets numbers of risers of stair flights - not recommended for use

```pascal
FUNCTION StairSetNumRisers(
				stair      : HANDLE;
				NumRisers1 : INTEGER;
				NumRisers2 : INTEGER;
				NumRisers3 : INTEGER;
				NumRisers4 : INTEGER) : BOOLEAN;
```

```python

def vs.StairSetNumRisers(stair, NumRisers1, NumRisers2, NumRisers3, NumRisers4):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|NumRisers1|INTEGER||
|NumRisers2|INTEGER||
|NumRisers3|INTEGER||
|NumRisers4|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs